package com.tla.uchattut.ui.chat

class ChatAdapter {
    //TODO("Код писать тут. Подключу к фрагменту я самостоятельно.
    // Можешь скатать вот отсюда https://codelabs.developers.google.com/codelabs/android-room-with-a-view-kotlin/#10
    // Код лучше пиши от руки, а не копируй, чтобы запомнить основные моменты
    // Будут вопросы пиши мне ВК
    // Еще надо разумеется сверстать item сообщения. Его надо поместить в res/layout ну и назови нормально, типа message_item
    // Контейнер айтема лучше взять Constraint Layout. Если там будут картинки, то не пытайся сделать их круглыми. Для этого есть Glide
    // Когда начнёшь работать, сделай новую ветку со своим именем/ником и пушь прямо в мой репозиторий. Если запушишь в мастер, будет хреново")
}